CSI API ETABS v1
cPropFrame.SetAngle_1 Method
 Initializes an angle-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetAngle_1(
	string Name,
	string MatProp,
	double T3,
	double T2,
	double Tf,
	double Tw,
	double FilletRadius,
	int Color = -1,
	string Notes = "",
	string GUID = ""
)
Function SetAngle_1 (
	Name As String,
	MatProp As String,
	T3 As Double,
	T2 As Double,
	Tf As Double,
	Tw As Double,
	FilletRadius As Double,
	Optional Color As Integer = -1,
	Optional Notes As String = "",
	Optional GUID As String = ""
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim MatProp As String
Dim T3 As Double
Dim T2 As Double
Dim Tf As Double
Dim Tw As Double
Dim FilletRadius As Double
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetAngle_1(Name,
	MatProp, T3, T2, Tf, Tw, FilletRadius,
	Color, Notes, GUID)
int SetAngle_1(
	String^ Name,
	String^ MatProp,
	double T3,
	double T2,
	double Tf,
	double Tw,
	double FilletRadius,
	int Color = -1,
	String^ Notes = L"",
	String^ GUID = L""
)
abstract SetAngle_1 :
        Name : string *
        MatProp : string *
        T3 : float *
        T2 : float *
        Tf : float *
        Tw : float *
        FilletRadius : float *
        ?Color : int *
        ?Notes : string *
        ?GUID : string
(* Defaults:
        let _Color = defaultArg Color -1
        let _Notes = defaultArg Notes ""
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
The name of an existing or new frame section property. If this is an existing property, that property is modified; otherwise, a new property is added.
MatProp
Type: System.String
The name of the material property for the section.
T3
Type: System.Double
The vertical leg depth. [L]
T2
Type: System.Double
The horizontal leg width. [L]
Tf
Type: System.Double
The horizontal leg thickness. [L]
Tw
Type: System.Double
The vertical leg thickness. [L]
FilletRadius
Type: System.Double
The fillet radius. [L]
Color (Optional)
Type: System.Int32
The display color assigned to the section. If Color is specified as -1, the program will automatically assign a color.
Notes (Optional)
Type: System.String
The notes, if any, assigned to the section.
GUID (Optional)
Type: System.String
The GUID (global unique identifier), if any, assigned to the section. If this item is input as Default, then the program assigns a GUID to the section.
Return Value
Type: Int32
returns zero if the section property is successfully initialized; otherwise it returns a nonzero value.
Remarks
 This function is obsolete and has been superseded by SetSteelAngle(String, String, Double, Double, Double, Double, Double, Boolean, Boolean, Int32, String, String) and SetConcreteL(String, String, Double, Double, Double, Double, Double, Boolean, Boolean, Int32, String, String) as of version 16.0.0. This function is maintained for backwards compatibility.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new frame section property
       ret = SapModel.PropFrame.SetAngle_1("ANGLE1", "A992Fy50", 6, 4, 0.5, 0.5, 0.25)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace